src/Assets/AmadeusRequestTemplates/Cancel.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<AuthenticationSoapHeader xmlns="http://epowerv5.amadeus.com.tr/WS">
			<WSUserName>{{WSUserName}}</WSUserName>
      <WSPassword>{{WSPassword}}</WSPassword>
		</AuthenticationSoapHeader>
	</soap:Header>
	<soap:Body>
		<Cancel xmlns="http://epowerv5.amadeus.com.tr/WS">
			<OTA_CancelRQ xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" Version="0" CancelType="Commit">
<BookingReferenceID Type="{{bookType}}" ID_Context="{{PNR}}" />
				<Verification>
					<PersonName>
						<Surname>{{leadLastName}}</Surname>
					</PersonName>
				</Verification>
			</OTA_CancelRQ>
		</Cancel>
	</soap:Body>
</soap:Envelope>
